Liuyuewei/STM32F407_OTG_FS_Udisk/uCGUI/GUIDemo/GUI_Test _1130优化采集流程前备份.c
#include "DIALOG.h"
#include "stm32f4xx_gpio.h"
#include "test.h"
#include "PROGBAR.h"
#include "glcd.h"
#include <stdio.h>
#include "WM.h"
#include "bsp_tft_lcd.h"
#include "main.h"
#include "GUI_task.h"
#include "main.h"
#include "ucOS_Task.h"
#include "FPGA_deal.h"
#include "stdio.h"
#include "GUI_typein.h"

static void NAME_input(void);



#define TEST_timeout   600000
#define Display_time   300          //提示信息刷新间隔时间  单位为ms

#define ID_FRAMEWIN_END              (GUI_ID_USER + 0x30)
#define ID_TEXT_END                  (GUI_ID_USER + 0x31)
#define ID_BUTTON_END_YES            (GUI_ID_USER + 0x32)
#define ID_BUTTON_END_NO             (GUI_ID_USER + 0x33)

#define ID_WINDOW_INFORMATION        (GUI_ID_USER + 0x70)
#define ID_EDIT_INFORMATION_ch       (GUI_ID_USER + 0x71)
#define ID_EDIT_INFORMATION_en       (GUI_ID_USER + 0x7E)
#define ID_TEXT_INFORMATION          (GUI_ID_USER + 0x72)

#define ID_INFORMATION_WORD_1        (GUI_ID_USER + 0x73)
#define ID_INFORMATION_WORD_2        (GUI_ID_USER + 0x74)
#define ID_INFORMATION_WORD_3        (GUI_ID_USER + 0x75)
#define ID_INFORMATION_WORD_4        (GUI_ID_USER + 0x76)
#define ID_INFORMATION_WORD_5        (GUI_ID_USER + 0x77)
#define ID_INFORMATION_WORD_6        (GUI_ID_USER + 0x78)
#define ID_INFORMATION_WORD_7        (GUI_ID_USER + 0x79)
#define ID_INFORMATION_WORD_8        (GUI_ID_USER + 0x7A)
#define ID_INFORMATION_WORD_9        (GUI_ID_USER + 0x7B)
#define ID_INFORMATION_WORD_A        (GUI_ID_USER + 0x7C)
#define ID_INFORMATION_WORD_B        (GUI_ID_USER + 0x7D)

#define ID_INFORMATION_KEY_1         (GUI_ID_USER + 0x40)
#define ID_INFORMATION_KEY_2         (GUI_ID_USER + 0x41)
#define ID_INFORMATION_KEY_3         (GUI_ID_USER + 0x42)
#define ID_INFORMATION_KEY_4         (GUI_ID_USER + 0x43)
#define ID_INFORMATION_KEY_5         (GUI_ID_USER + 0x44)
#define ID_INFORMATION_KEY_6         (GUI_ID_USER + 0x45)
#define ID_INFORMATION_KEY_7         (GUI_ID_USER + 0x46)
#define ID_INFORMATION_KEY_8         (GUI_ID_USER + 0x47)
#define ID_INFORMATION_KEY_9         (GUI_ID_USER + 0x48)
#define ID_INFORMATION_KEY_0         (GUI_ID_USER + 0x49)
#define ID_INFORMATION_KEY_BACKSPACE (GUI_ID_USER + 0x4A)
#define ID_INFORMATION_KEY_Q         (GUI_ID_USER + 0x4B)
#define ID_INFORMATION_KEY_W         (GUI_ID_USER + 0x4C)
#define ID_INFORMATION_KEY_E         (GUI_ID_USER + 0x4D)
#define ID_INFORMATION_KEY_R         (GUI_ID_USER + 0x4E)
#define ID_INFORMATION_KEY_T         (GUI_ID_USER + 0x4F)
#define ID_INFORMATION_KEY_Y         (GUI_ID_USER + 0x50)
#define ID_INFORMATION_KEY_U         (GUI_ID_USER + 0x51)
#define ID_INFORMATION_KEY_I         (GUI_ID_USER + 0x52)
#define ID_INFORMATION_KEY_O         (GUI_ID_USER + 0x53)
#define ID_INFORMATION_KEY_P         (GUI_ID_USER + 0x54)
#define ID_INFORMATION_KEY_PLUS      (GUI_ID_USER + 0x55)
#define ID_INFORMATION_KEY_CAPITIAL  (GUI_ID_USER + 0x56)
#define ID_INFORMATION_KEY_A         (GUI_ID_USER + 0x57)
#define ID_INFORMATION_KEY_S         (GUI_ID_USER + 0x58)
#define ID_INFORMATION_KEY_D         (GUI_ID_USER + 0x59)
#define ID_INFORMATION_KEY_F         (GUI_ID_USER + 0x5A)
#define ID_INFORMATION_KEY_G         (GUI_ID_USER + 0x5B)
#define ID_INFORMATION_KEY_H         (GUI_ID_USER + 0x5C)
#define ID_INFORMATION_KEY_J         (GUI_ID_USER + 0x5D)
#define ID_INFORMATION_KEY_K         (GUI_ID_USER + 0x5E)
#define ID_INFORMATION_KEY_L         (GUI_ID_USER + 0x5F)
#define ID_INFORMATION_KEY_ENTER     (GUI_ID_USER + 0x60)
#define ID_INFORMATION_KEY_SHIFT     (GUI_ID_USER + 0x61)
#define ID_INFORMATION_KEY_Z         (GUI_ID_USER + 0x62)
#define ID_INFORMATION_KEY_X         (GUI_ID_USER + 0x63)
#define ID_INFORMATION_KEY_C         (GUI_ID_USER + 0x64)
#define ID_INFORMATION_KEY_V         (GUI_ID_USER + 0x65)
#define ID_INFORMATION_KEY_B         (GUI_ID_USER + 0x66)
#define ID_INFORMATION_KEY_N         (GUI_ID_USER + 0x67)
#define ID_INFORMATION_KEY_M         (GUI_ID_USER + 0x68)
#define ID_INFORMATION_KEY_SLASH     (GUI_ID_USER + 0x69)
#define ID_INFORMATION_KEY_POINT     (GUI_ID_USER + 0x6A)
#define ID_INFORMATION_KEY_EXIT      (GUI_ID_USER + 0x6B)


extern const char * py_ime(char *);


unsigned char test_choice = 0;
unsigned char start_flag = 0; 
//start_flag = 0:正常状态         
//start_flag = 1:FPGA发送过来的数据出错   
//start_flag = 2:等待FPGA发来试剂卡插入状态超时
//start_flag = 3:等待FPGA发来SPOT CODE扫描完成超时
//start_flag = 4:等待FPGA发来采血管插入成功状态超时
//start_flag = 5:等待FPGA发来血液吸入加热槽完成状态超时 
//start_flag = 6:等待FPGA发来血液压入测量槽完成状态超时 
//start_flag = 7:等待FPGA发来测量完成状态超时
//start_flag = 7:测量过程中点击了结束测量按钮

uint8_t FPGA_IO_data = 0;                               //接受FPGA发送过来的数据
uint8_t FPGA_IO_flag = 0;                               //置1则表示FPGA端有数据传输过来 
uint16_t measure_data_CH1[1000] = {0};
uint16_t measure_data_CH2[1000] = {0};
uint16_t measure_data_CH3[1000] = {0};
uint16_t measure_data_CH4[1000] = {0};
uint16_t SPI1_data_spi[4000] = {0};
uint16_t SPOT_CODE_Data[2] = {0};                       //存储SPOT CODE数据 
uint32_t Test_time = 0;                                 //超时时间 

/*点击结束按钮后需要用到的一些变量*/
uint8_t END_Measure = 0;                                //0：点击按钮后不结束测量 1：点击按钮后结束测量 

uint8_t  *Error_warning[] = {
// 	                             "The communication with FPGA is wrong!",
// 	                             "Waiting for card insert is timeout!",
// 	                             "Waiting for spot code is timeout!",
// 	                             "Waiting for tube insert is timeout!",
// 	                             "Waiting for suck blood is timeout!",
// 	                             "Waiting for press blood is timeout!",
// 	                             "Waiting for measure finish is timeout!",
	                             "Communication Wrong!",
	                             "Card Insert Timeout!",
	                             "Spot Code Timeout!",
	                             "Tube Insert Timeout!",
	                             "Suck Blood Timeout!",
	                             "Press Blood Timeout!",
	                             "Measure Timeout!",
                              };


static const char Lower_keys[]=
{
    '1','2','3','4','5','6','7','8','9','0','<',
    'q','w','e','r','t','y','u','i','o','p','-',
    '^','a','s','d','f','g','h','j','k','l',' ',
    ' ','z','x','c','v','b','n','m','/','.',' '
};
static const char Capital_keys[]=
{
    '1','2','3','4','5','6','7','8','9','0','<',
    'Q','W','E','R','T','Y','U','I','O','P','-',
    '^','A','S','D','F','G','H','J','K','L',' ',
    ' ','Z','X','C','V','B','N','M','/','.',' '
};


/*********************************************************************
*
*       _aDialogCreate_warning       错误提示窗口 由一个按钮结束该窗口 
*/
static const GUI_WIDGET_CREATE_INFO _aDialogCreate_warning[] = {
  { FRAMEWIN_CreateIndirect, "Framewin", ID_FRAMEWIN_0, 300, 210, 200, 120},
  { TEXT_CreateIndirect, "Text", ID_TEXT_0, 10, 20, 180, 20},
  { BUTTON_CreateIndirect, "Button", ID_BUTTON_0, 50, 50, 80, 40},
};

/*********************************************************************
*
*       _cbDialog_warning 错误提示窗口回调函数
*/
static void _cbDialog_warning(WM_MESSAGE * pMsg) {
  WM_HWIN hItem;
  int Id, NCode;
	hItem = pMsg->hWin;
	
  switch (pMsg->MsgId) {
  case WM_INIT_DIALOG:                          //对错误提示窗口的初始化 包括文本信息等
		
