Liuyuewei/STM32F407_OTG_FS_Udisk/uCGUI/GUIDemo/GUI_Test _1130优化采集流程前备份.c
    FRAMEWIN_SetText(hItem, "WARNING");
    FRAMEWIN_SetTitleHeight(hItem, 20);
	
    hItem = WM_GetDialogItem(pMsg->hWin, ID_TEXT_0);
	  TEXT_SetTextAlign(hItem,TEXT_CF_HCENTER);
	  if(start_flag > 1)
    {
		  TEXT_SetText(hItem, Error_warning[start_flag-1]);
		}
		else
		{
			TEXT_SetText(hItem, "UNKNOWN WRONG!");
		}
	  
	  hItem = WM_GetDialogItem(pMsg->hWin, ID_BUTTON_0);
    BUTTON_SetText(hItem, "OK");
	  
    break;
	  case WM_NOTIFY_PARENT:                        //对按键信息进行响应
    Id    = WM_GetId(pMsg->hWinSrc);
    NCode = pMsg->Data.v;
	  switch(NCode) 
	  {
			case WM_NOTIFICATION_RELEASED:              //在按键松开时进行响应
				switch(Id) 
				{
					case ID_BUTTON_0: 
					{
						hItem = pMsg->hWin;
						WM_DeleteWindow(hItem);
						GUI_EndDialog(hItem,0);               //结束该错误提示窗口
						GUI_Exec();
						break;
					}
			 }
			 break;
	  }
    break;
  default:
    WM_DefaultProc(pMsg);
    break;
  }
}

/*********************************************************************
*
*       CreateFramewin    建立错误提示窗口 由回调函数结束该进程
*/
WM_HWIN CreateFramewin_warning(void);
WM_HWIN CreateFramewin_warning(void) 
{
  WM_HWIN hWin;
  //WM_SetCreateFlags(WM_CF_MEMDEV);
  hWin = GUI_ExecDialogBox(_aDialogCreate_warning, GUI_COUNTOF(_aDialogCreate_warning), &_cbDialog_warning, WM_HBKWIN, 0, 0);
  return hWin;
}


/*********************************************************************
*
*       _aDialogCreate_end       错误提示窗口 由一个按钮结束该窗口 
*/
static const GUI_WIDGET_CREATE_INFO _aDialogCreate_end[] = {
  { FRAMEWIN_CreateIndirect, "Framewin", ID_FRAMEWIN_END, 300, 210, 200, 120},
//   { TEXT_CreateIndirect, "Text", ID_TEXT_END, 10, 20, 180, 40},
//   { BUTTON_CreateIndirect, "Button", ID_BUTTON_END_YES, 30, 70, 80, 40},
//   { BUTTON_CreateIndirect, "Button", ID_BUTTON_END_NO, 120, 70, 80, 40},
  { TEXT_CreateIndirect, "Text", ID_TEXT_END, 10, 20, 180, 20},
  { BUTTON_CreateIndirect, "德", ID_BUTTON_END_YES, 5, 45, 90, 50},
  { BUTTON_CreateIndirect, "德", ID_BUTTON_END_NO, 105, 45, 90, 50},
};

/*********************************************************************
*
*       _cbDialog_end 错误提示窗口回调函数
*/
static void _cbDialog_end(WM_MESSAGE * pMsg) {
  WM_HWIN hItem;
  int Id, NCode;
	hItem = pMsg->hWin;
	
  switch (pMsg->MsgId) {
  case WM_INIT_DIALOG:                          //对错误提示窗口的初始化 包括文本信息等
		
    FRAMEWIN_SetText(hItem, "WARNING");
    FRAMEWIN_SetTitleHeight(hItem, 20);
	
    hItem = WM_GetDialogItem(pMsg->hWin, ID_TEXT_END);
	  TEXT_SetTextAlign(hItem,TEXT_CF_HCENTER);
 	  TEXT_SetText(hItem, "END THIS MEASUREMENT?");
	  	
	  hItem = WM_GetDialogItem(pMsg->hWin, ID_BUTTON_END_YES);
	  BUTTON_SetTextColor(hItem,0,GUI_WHITE);
	  BUTTON_SetTextColor(hItem,1,GUI_WHITE);
 	  BUTTON_SetFont(hItem,&GUI_FontHZ24);
	
	  hItem = WM_GetDialogItem(pMsg->hWin, ID_BUTTON_END_NO);
	  BUTTON_SetTextColor(hItem,0,GUI_WHITE);
	  BUTTON_SetTextColor(hItem,1,GUI_WHITE);
	  BUTTON_SetFont(hItem,&GUI_FontHZ24);
	  
    break;
	  case WM_NOTIFY_PARENT:                        //对按键信息进行响应
    Id    = WM_GetId(pMsg->hWinSrc);
    NCode = pMsg->Data.v;
	  switch(NCode) 
	  {
			case WM_NOTIFICATION_RELEASED:              //在按键松开时进行响应
				switch(Id) 
				{
					case ID_BUTTON_END_YES: 
					{
						hItem = pMsg->hWin;
						END_Measure = 1;
						WM_DeleteWindow(hItem);
						GUI_EndDialog(hItem,0);               //结束该错误提示窗口
						GUI_Exec();
						break;
					}
					case ID_BUTTON_END_NO: 
					{
						hItem = pMsg->hWin;
						END_Measure = 0;
						WM_DeleteWindow(hItem);
						GUI_EndDialog(hItem,0);               //结束该错误提示窗口
						GUI_Exec();
						break;
					}
					default:
						break;
			 }
			 break;
	  }
    break;
  default:
    WM_DefaultProc(pMsg);
    break;
  }
}

/*********************************************************************
*
*   CreateFramewin_End 点击结束测量按钮后的处理程序  由回调函数结束该进程
*/
WM_HWIN CreateFramewin_End(void);
WM_HWIN CreateFramewin_End(void) 
{
  WM_HWIN hWin;
  //WM_SetCreateFlags(WM_CF_MEMDEV);
  hWin = GUI_ExecDialogBox(_aDialogCreate_end, GUI_COUNTOF(_aDialogCreate_end), &_cbDialog_end, WM_HBKWIN, 0, 0);
  return hWin;
}

/*测量流程设计*/
WM_HWIN Create_Test(void) {
  
	BUTTON_Handle btn_Test_hl,btn_Set_hl,btn_Control_hl,btn_History_hl;
	static unsigned char btn_Xsize = 200, btn_Ysize = 60;
	static int i = 0;
	int key_num = 0;
	
	//显示主界面
	bmp_dispflash(0xBB810,0,0);	
	SERIAL_ROM_Font_mode();
	Graphic_Mode();
	
	do
	{
		if (!GUI_Exec()) 
		{
			GUI_WaitEvent();      
		}
		
// 		key_num =  GUI_GetKey();
		
		if (TOUCH_InRect(ts_event.x1, ts_event.y1, 5, 420, 60, 200) && (g_ucTouch == 1)) //按test按键 无需响应
		{
			test_choice = 0;
			ts_event.x1 = -1;
			ts_event.y1 = -1;
			g_ucTouch = 0;
			_StoreUnstable(-1, -1);
		}
		else if (TOUCH_InRect(ts_event.x1, ts_event.y1, 200, 420, 60, 200) && (g_ucTouch == 1))//按setting按键 
		{
			test_choice = 1;
			ts_event.x1 = -1;
			ts_event.y1 = -1;
			g_ucTouch = 0;
			_StoreUnstable(-1, -1);
		}
		else if (TOUCH_InRect(ts_event.x1, ts_event.y1, 395, 420, 60, 200) && (g_ucTouch == 1))//按control按键
		{
			test_choice = 2;
			ts_event.x1 = -1;
			ts_event.y1 = -1;
			g_ucTouch = 0;
			_StoreUnstable(-1, -1);
		}
		else if (TOUCH_InRect(ts_event.x1, ts_event.y1, 590, 420, 60, 200) && (g_ucTouch == 1))//按history按键 
		{
			test_choice = 3;
			ts_event.x1 = -1;
			ts_event.y1 = -1;
			g_ucTouch = 0;
			_StoreUnstable(-1, -1);
		}
		else if (TOUCH_InRect(ts_event.x1, ts_event.y1, 680, 175, 100, 115) && (g_ucTouch == 1))   //点击开始测试按钮
		{
			TEST_begin();                             //调用测试函数
			bmp_dispflash(0xBB810,0,0);	              //此次测试结束 重新显示测试界面 
			SERIAL_ROM_Font_mode();
			Graphic_Mode();
			ts_event.x1 = -1;
			ts_event.y1 = -1;
			g_ucTouch = 0;
			_StoreUnstable(-1, -1);
		}
		else if (TOUCH_InRect(ts_event.x1, ts_event.y1, 680,50, 100, 115) && (g_ucTouch == 1))   //点击病人信息按钮
		{
			TEST_type_information();
			ts_event.x1 = -1;
			ts_event.y1 = -1;
			g_ucTouch = 0;
			_StoreUnstable(-1, -1);
				//显示主界面
			bmp_dispflash(0xBB810,0,0);	
			SERIAL_ROM_Font_mode();
			Graphic_Mode();
			
