Liuyuewei/STM32F407_OTG_FS_Udisk/uCGUI/GUIDemo/GUI_Test _1130优化采集流程前备份.c
		}
		
		
		if(test_choice != 0)                       //点开了其它三个按键 需要进行相应处理 如 设置 质控 历史记录查询等
		{
// 			BUTTON_Delete(btn_Test_hl);
// 			BUTTON_Delete(btn_Set_hl);
// 			BUTTON_Delete(btn_Control_hl);
// 			BUTTON_Delete(btn_History_hl);
			break;
		}
	}
	while(1);
	return hWin;
}

void TEST_begin(void)
{
	FONT_T tFont;			/* 定义一个字体结构体变量，用于设置字体参数 */
	static unsigned long time_out_old = 0; //数据刷新时使用
	unsigned char Prompt_flag = 0;         //0：此时操作提示处显示为空 1：此时操作提示处显示为相应操作
	unsigned int i = 0,data_receive = 0,j,k,l,m,data_in;  //接收数据时使用的一些中间变量
	unsigned char ADC_num = 0;
	char buffer[64] ={0};
	char clear[64] = "         ";
	unsigned char spot_code_flag = 0;                     //0：spot code传输未完成 1：spot code数据传输完成
  unsigned char spot_code_h = 0;                        //0：spot code高位传输未完成  1：spot code高位数据传输已完成
	unsigned char spot_code_l = 0;                        //0：spot code低位传输未完成  1：spot code低位数据传输已完成
  PROGBAR_Handle progbar_test;                          //进度条显示的句柄
  unsigned char spot_code_str[16] = {0};                //用于spot code显示的测试数组
  unsigned char progbar_data = 0;                       //进度条数据
  unsigned char close_window_time = 0;     //提示10次关闭黑盒盖子
  
  unsigned char data_h = 0,data_l = 0;

	// 	 设置字体参数
	{
		tFont.usFontCode = FC_ST_16;	/* 字体代码 16点阵 */ // 汉字大小为16*16 字母大小为 宽8高16
		tFont.usTextColor = CL_BLACK;	/* 字体颜色 */
		tFont.usBackColor = CL_WHITE;	/* 文字背景颜色 */
		tFont.usSpace = 0;				/* 文字间距，单位 = 像素 */
	}
	
	/*复位FPGA状态*/
	PG6_IO_reset();
	delay_nms(30);
	printf("\r\nFPGA RESET!\r\n");
	PG6_IO_set();
  
	/*对变量进行初始化*/
	start_flag = 0;
	FPGA_IO_flag = 0;
	FPGA_IO_data = 0;
	
	/*建立进度条控件 显示测试进度*/
  progbar_test = PROGBAR_Create(40,200, 500, 20, WM_CF_SHOW);  
	PROGBAR_EnableMemdev(progbar_test);
  //PROGBAR_SetFont(progbar_test, &tFont);
  PROGBAR_SetBarColor(progbar_test, 0, GUI_GREEN);       //已刷新的进度条颜色
  PROGBAR_SetBarColor(progbar_test, 1, GUI_LIGHTBLUE);       //未刷新的进度条颜色
  PROGBAR_SetTextAlign(progbar_test, GUI_TA_CENTER);     //字体位于进度条中心
	PROGBAR_SetMinMax(progbar_test,0,100);                 //进度条的最大值和最小值
	PROGBAR_SetTextColor(progbar_test,0,GUI_BLACK);        //设置字体颜色
	PROGBAR_SetTextColor(progbar_test,1,GUI_BLACK);        //设置字体颜色
	//PROGBAR_SetValue(progbar_test, 0);                     //设置进度值 显示为百分比 由于范围为(0，100)，故显示为此百分比
	//GUI_Exec();
	
	//CreateFramewin_warning();
	
	//RA8875_DispStr(50, 0, "Insert Card!            ", &tFont);	
	
	//发送开始测量信号
	send_command_FPGA(INSERT_CARD_COMMAND);
	
// 	Test_time = TEST_timeout;
// 	time_out_old = TEST_timeout;
	while(FPGA_IO_flag == 0)                       //等待FPGA发来试剂卡插入状态数据
	{
// 		if(Test_time == 0)                           //等待超时 提示错误信息并返回
// 		{
// 			start_flag = 2;
// 			break;
// 		}
// 		if((time_out_old - Test_time < 400)&&(Prompt_flag == 0))
// 		{
// 			RA8875_FillRect(100,180,100,60,0xF79E);
// 			Prompt_flag = 1;
// 		}
// 		else if(((time_out_old - Test_time > 400)&&(time_out_old - Test_time < 800)&&(Prompt_flag == 1)))
// 		{
// 			bmp_dispflash(0xBB810,0,0);	
// 			SERIAL_ROM_Font_mode();
// 			Graphic_Mode();
// 			Prompt_flag = 0;
// 		}
// 		else if(time_out_old - Test_time > 800)
// 		{
// 			time_out_old = Test_time;
// 			Prompt_flag = 0;
// 		}
    /*闪烁插卡标志 提示用户插入试剂卡*/
		RA8875_FillRect(100,170,100,60,0xF79E);
		OSTimeDlyHMSM(0, 0, 0, Display_time);
		bmp_dispflash(0xBB810,0,0);	
		SERIAL_ROM_Font_mode();
		Graphic_Mode();
		OSTimeDlyHMSM(0, 0, 0, Display_time);
		/*扫描是否点击了结束测量按钮 如果点击了结束按钮且再次确认结束测量 则结束该测量进程*/
		END_Measure = 0;
		if (TOUCH_InRect(ts_event.x1, ts_event.y1, 680, 175, 100, 115) && (g_ucTouch == 1))
		{
			PROGBAR_Delete(progbar_test);
	    PROGBAR_Delete(progbar_test);
			CreateFramewin_End();
			//test_choice = 2;
			ts_event.x1 = -1;
			ts_event.y1 = -1;
			g_ucTouch = 0;
			_StoreUnstable(-1, -1);
		}
		if(END_Measure == 1)
		{
			start_flag = 8;
			break;
		}
	}
	
	//刷屏 防止界面不对
	bmp_dispflash(0xBB810,0,0);	
	SERIAL_ROM_Font_mode();
	Graphic_Mode();
	
	if(start_flag == 0)
	{
		if(FPGA_IO_flag == 1)                           //接收到了FPGA传来的数据
		{
			if(FPGA_IO_data == CARD_FINISHED_STATUES)     //接收到试剂卡插入成功状态数据
			{
				//RA8875_DispStr(50, 0, "SACN SPOT CODE!                 ", &tFont);
				//PROGBAR_SetValue(progbar_test, 10);                     //设置进度值 显示为百分比 由于范围为(0，100)，故显示为此百分比
	      //GUI_Exec();
				FPGA_IO_flag = 0;
				send_command_FPGA(SCAN_SPOT_CODE_COMMAND); 
			}
			else 
			{
				FPGA_IO_flag = 0;
				if(start_flag != 8)
				{
				  start_flag = 1;
				}
				//RA8875_DispStr(50, 0, "CARD INSERT IS WRONG!     ", &tFont);
				delay_nms(5000);
			}
		}
  }
	
	if(start_flag == 0)
	{                       
    Test_time = TEST_timeout;
	  time_out_old = TEST_timeout;
    while(FPGA_IO_flag == 0)                       //等待FPGA发来SPOT CODE扫描状态数据
	  {
		  if(Test_time == 0)                           //等待超时 提示错误信息并返回
		  {
			  start_flag = 3;
			  break;
		  }
	  }
		
		if(FPGA_IO_flag == 1)
		{
			if(FPGA_IO_data == SPOT_FINISHED_STATUES)     //接收到SPOT CODE扫描完成状态 开始读取SPOT CODE数据
			{
				while(spot_code_flag == 0)
				{
					delay_nus(500);
					data_receive = SPI1_Receive();                           //接收SPOT CODE数据
					if(data_receive != 0xFFFF)
					{
						if(((data_receive&0x5400) == 0x5400))                                         //接收到高位数据
						{
							spot_code_h = 1;
							SPOT_CODE_Data[1] = data_receive;
						}
						else if(((data_receive&0x5000) == 0x5000))                                    //接收到低位数据
						{
							spot_code_l = 1;
							SPOT_CODE_Data[0] = data_receive;
						}
						if ((spot_code_h == 1)&&(spot_code_l == 1))      //高低位数据均已接收
						{
							spot_code_flag = 1;
							//PROGBAR_SetValue(progbar_test, 20);                     //设置进度值 显示为百分比 由于范围为(0，100)，故显示为此百分比
	            //GUI_Exec();
						}
					}
				}
				if(1)                                        //对SOPT CODE数据进行判断 暂无 后续添加
				{
					;;
				}
				/*将SPOT CODE数据显示在屏幕上*/
				for(i = 0;i < 16;i++)
				{
					if((SPOT_CODE_Data[1]&0x8000) != 0)
					{
						spot_code_str[i] = '1';
					}
					else
					{
						spot_code_str[i] = '0';
					}
					SPOT_CODE_Data[1] = SPOT_CODE_Data[1] << 1;					
				}			
				//RA8875_DispStr(0, 200, "HIGH BYTE", &tFont);
				sprintf(&buffer[0], "%d", SPOT_CODE_Data[0]);
				//RA8875_DispStr(100, 200, spot_code_str, &tFont);
				
