Liuyuewei/STM32F407_OTG_FS_Udisk/uCGUI/GUIDemo/GUI_Test _1130优化采集流程前备份.c
				for(i = 0;i < 16;i++)
				{
					if((SPOT_CODE_Data[0]&0x8000) != 0)
					{
						spot_code_str[i] = '1';
					}
					else
					{
						spot_code_str[i] = '0';
					}
					SPOT_CODE_Data[0] = SPOT_CODE_Data[0] << 1;					
				}			
				//RA8875_DispStr(0, 300, "LOW BYTE", &tFont);
				sprintf(&buffer[1], "%d", SPOT_CODE_Data[0]);
				//RA8875_DispStr(100, 300, spot_code_str, &tFont);
				
				
        //PROGBAR_SetValue(progbar_test, 30);                     //设置进度值 显示为百分比 由于范围为(0，100)，故显示为此百分比
        //GUI_Exec();
				
				//RA8875_DispStr(50, 0, "INSERT THE TUBE!            ", &tFont);
				FPGA_IO_flag = 0;
				send_command_FPGA(INSERT_TUBE_COMMAND);      //发送插采血管的指令
			}
			else 
			{
				FPGA_IO_flag = 0;
				if(start_flag != 8)
				{
				  start_flag = 1;
				}
				//RA8875_DispStr(50, 0, "SACN SPOT DATA IS WRONG!     ", &tFont);
  		  delay_nms(5000);
			}
		}
  }
	                   
	if(start_flag == 0)
	{            
// 		Test_time = TEST_timeout;
// 	  time_out_old = TEST_timeout;
// 		Prompt_flag = 0;
    while(FPGA_IO_flag == 0)                       //等待FPGA发来采血管插入状态
	  {
// 		  if(Test_time == 0)                           //等待超时 提示错误信息并返回
// 		  {
// 			  start_flag = 4;
// 			  break;
// 		  }
// 			if((time_out_old - Test_time < 400)&&(Prompt_flag == 0))
// 			{
// 				//RA8875_DispStr(50, 0, "Insert Card!            ", &tFont);
// 				RA8875_FillRect(300,170,100,40,0xF79E);
// 				Prompt_flag = 1;
// 			}
// 			else if(((time_out_old - Test_time > 400)&&(time_out_old - Test_time < 800)&&(Prompt_flag == 1)))
// 			{
// 				//RA8875_DispStr(50, 0, "                        ", &tFont);
// 				bmp_dispflash(0xBB810,0,0);	
// 				SERIAL_ROM_Font_mode();
// 				Graphic_Mode();
// 				Prompt_flag = 0;
// 			}
// 			else if(time_out_old - Test_time > 800)
// 			{
// 				time_out_old = Test_time;
// 				Prompt_flag = 0;
// 			}
	    /*闪烁采血管标志 提示用户插入采血管*/
			RA8875_FillRect(300,170,100,40,0xF79E);
			OSTimeDlyHMSM(0, 0, 0, Display_time);
			bmp_dispflash(0xBB810,0,0);	
			SERIAL_ROM_Font_mode();
			Graphic_Mode();
			OSTimeDlyHMSM(0, 0, 0, Display_time);
			END_Measure = 0;
			if (TOUCH_InRect(ts_event.x1, ts_event.y1, 680, 175, 100, 115) && (g_ucTouch == 1))
			{
				PROGBAR_Delete(progbar_test);
	      PROGBAR_Delete(progbar_test);
				CreateFramewin_End();
				//test_choice = 2;
			  ts_event.x1 = -1;
			  ts_event.y1 = -1;
			  g_ucTouch = 0;
			  _StoreUnstable(-1, -1);
			}
			if(END_Measure == 1)
			{
				start_flag = 8;
				break;
			}
	  }
		//刷屏 防止界面不对
		bmp_dispflash(0xBB810,0,0);	
		SERIAL_ROM_Font_mode();
		Graphic_Mode();
		
		if(FPGA_IO_flag == 1)
		{
			if(FPGA_IO_data == TUBE_FINISHED_STATUES)     //接收到采血管插入正常指令 发送抽血到加热槽指令
			{
				//RA8875_DispStr(50, 0, "SUCK THE BLOOD!                 ", &tFont);
				FPGA_IO_flag = 0;
				//PROGBAR_SetValue(progbar_test, 40);                     //设置进度值 显示为百分比 由于范围为(0，100)，故显示为此百分比
        //GUI_Exec();
				for(close_window_time=0;close_window_time<6;close_window_time++)
				{
				  RA8875_FillRect(450,170,100,125,0xF79E);
					OSTimeDlyHMSM(0, 0, 0, Display_time);
					END_Measure = 0;
					if (TOUCH_InRect(ts_event.x1, ts_event.y1, 680, 175, 100, 115) && (g_ucTouch == 1))
					{
				    PROGBAR_Delete(progbar_test);
	          PROGBAR_Delete(progbar_test);
						CreateFramewin_End();
						//test_choice = 2;
						ts_event.x1 = -1;
						ts_event.y1 = -1;
						g_ucTouch = 0;
						_StoreUnstable(-1, -1);
					}
					if(END_Measure == 1)
					{
						start_flag = 8;
						break;
					}
				  bmp_dispflash(0xBB810,0,0);	
				  SERIAL_ROM_Font_mode();
				  Graphic_Mode();
					OSTimeDlyHMSM(0, 0, 0, Display_time);
// 				  Test_time = 400;
// 					while(Test_time != 0);
// 				  Test_time = 400;
// 					while(Test_time != 0);
				}
				
				
				send_command_FPGA(SUCK_BLOOD_COMMAND);      //发送抽血到加热槽的指令
			}
			else 
			{
				FPGA_IO_flag = 0;
				if(start_flag != 8)
				{
				  start_flag = 1;
				}
				//RA8875_DispStr(50, 0, "TUBE INSERT IS WRONG!          ", &tFont);
  		  delay_nms(5000);
			}
		}
	}
                      
	if(start_flag == 0)
	{
		bmp_dispflash(0x00,0,0);
		SERIAL_ROM_Font_mode();
		Graphic_Mode();
    PROGBAR_SetValue(progbar_test, 0);                     //设置进度值 显示为百分比 由于范围为(0，100)，故显示为此百分比
    GUI_Exec();		
		Test_time = TEST_timeout;
    while(FPGA_IO_flag == 0)                       //等待FPGA发来吸血到加热槽的状态
	  {
		  if(Test_time == 0)                           //等待超时 提示错误信息并返回
		  {
			  start_flag = 5;
			  break;
		  }
			OSTimeDlyHMSM(0, 0, 0, 50);
			END_Measure = 0;
			if (TOUCH_InRect(ts_event.x1, ts_event.y1, 680, 175, 100, 115) && (g_ucTouch == 1))
			{
				PROGBAR_Delete(progbar_test);
	      PROGBAR_Delete(progbar_test);
				CreateFramewin_End();
				//test_choice = 2;
				ts_event.x1 = -1;
				ts_event.y1 = -1;
				g_ucTouch = 0;
				_StoreUnstable(-1, -1);
			}
			if(END_Measure == 1)
			{
				start_flag = 8;
				break;
			}
	  }
		if(FPGA_IO_flag == 1)
		{
			if(FPGA_IO_data == SUCK_FINISHED_STATUES)     //吸血到加热槽完成
			{
				Heat_enable();                              //开始加热血液
				delay_nms(50);	
				Heat_disable();
				//RA8875_DispStr(50, 0, "PRESS THE BLOOD!                 ", &tFont);
				FPGA_IO_flag = 0;
				PROGBAR_SetValue(progbar_test, 10);                     //设置进度值 显示为百分比 由于范围为(0，100)，故显示为此百分比
        GUI_Exec();
				send_command_FPGA(HEAT_FINISHED_COMMAND);      //加热血液完成 可以将血液压入测量槽
				
			}
			else 
			{
				FPGA_IO_flag = 0;
				if(start_flag != 8)
				{
				  start_flag = 1;
				}
				//RA8875_DispStr(50, 0, "SUKE BLOOD IS WRONG!          ", &tFont);
  		  delay_nms(5000);
			}
		}
	}		
               
	if(start_flag == 0)
	{                        
		Test_time = TEST_timeout;
    while(FPGA_IO_flag == 0)                       //等待FPGA发来血液进入测量槽成功状态
	  {
		  if(Test_time == 0)                           //等待超时 提示错误信息并返回
		  {
			  start_flag = 6;
			  break;
		  }
			OSTimeDlyHMSM(0, 0, 0, 50);
			END_Measure = 0;
			if (TOUCH_InRect(ts_event.x1, ts_event.y1, 680, 175, 100, 115) && (g_ucTouch == 1))
			{
				PROGBAR_Delete(progbar_test);
	      PROGBAR_Delete(progbar_test);
				CreateFramewin_End();
				//test_choice = 2;
				ts_event.x1 = -1;
				ts_event.y1 = -1;
				g_ucTouch = 0;
				_StoreUnstable(-1, -1);
			}
			if(END_Measure == 1)
			{
				start_flag = 8;
				break;
			}
	  }
		if(FPGA_IO_flag == 1)
		{
			if(FPGA_IO_data == PRESS_FINISHED_STATUES)     //压血到测量槽成功
			{
				//send_command_FPGA(START_MEASURE_COMMAND);      //开始测量
				//RA8875_DispStr(50, 0, "START MEASURE!                 ", &tFont);
				PROGBAR_SetValue(progbar_test, 30);                     //设置进度值 显示为百分比 由于范围为(0，100)，故显示为此百分比
        GUI_Exec();
				FPGA_IO_flag = 0;
			}
			else 
			{
				FPGA_IO_flag = 0;
				if(start_flag != 8)
				{
				  start_flag = 1;
				}
				//RA8875_DispStr(50, 0, "PRESS BLOOD IS WRONG!          ", &tFont);
  		  delay_nms(5000);
			}
		}	
	}
	
	if(start_flag == 0)
	{
		Test_time = TEST_timeout;
    while(FPGA_IO_flag == 0)                       //等待FPGA发来读数完成指令
	  {
		  if(Test_time == 0)                           //等待超时 提示错误信息并返回
		  {
			  start_flag = 7;
			  break;
		  }
			OSTimeDlyHMSM(0, 0, 0, 50);
			END_Measure = 0;
			if (TOUCH_InRect(ts_event.x1, ts_event.y1, 680, 175, 100, 115) && (g_ucTouch == 1))
			{
				PROGBAR_Delete(progbar_test);
	      PROGBAR_Delete(progbar_test);
				CreateFramewin_End();
				//test_choice = 2;
				ts_event.x1 = -1;
				ts_event.y1 = -1;
				g_ucTouch = 0;
				_StoreUnstable(-1, -1);
			}
			if(END_Measure == 1)
			{
				start_flag = 8;
				break;
			}
	  }
		if(FPGA_IO_flag == 1)
		{
			if(FPGA_IO_data == MEASURE_FINISHED_STATUES)     //FPGA读数完成
			{
				FPGA_IO_flag = 0;
				PROGBAR_SetValue(progbar_test, 50);                     //设置进度值 显示为百分比 由于范围为(0，100)，故显示为此百分比
        GUI_Exec();
				j = 0;k = 0;l = 0;m = 0;
						
				//接受4096个FPGA发送来的数据并分别存储在4个数组中 通过数据的高4位判断数据位置
				for(i = 0;i < 4096;i++)
				{
					delay_nus(100);
					data_receive = SPI1_Receive();
					SPI1_data_spi[i] = data_receive;
					ADC_num = data_receive >> 12;
					switch(ADC_num)
					{
						case 1:
						{
							measure_data_CH1[j] = data_receive & 0x0FFF;
							j = j+1;
							printf("CH%d data%d is %d.\n",ADC_num,j,(data_receive & 0x0FFF));
							break;
						}
						case 2:
						{
							measure_data_CH2[k] = data_receive & 0x0FFF;
							k = k+1;
							printf("CH%d data%d is %d.\n",ADC_num,k,(data_receive & 0x0FFF));
							break;
						}
						case 3:
						{
							measure_data_CH3[l] = data_receive & 0x0FFF;
							l = l+1;
							printf("CH%d data%d is %d.\n",ADC_num,l,(data_receive & 0x0FFF));
							break;
						}
						case 4:
						{
							measure_data_CH4[m] = data_receive & 0x0FFF;
							m = m+1;
							printf("CH%d data%d is %d.\n",ADC_num,m,(data_receive & 0x0FFF));
							break;
						}
						default:
						{
							i = i-1;
						}					
					}
					if(i%135 == 0)
					{
						PROGBAR_SetValue(progbar_test, (50+(i*50/4095)));                     //设置进度值 显示为百分比 由于范围为(0，100)，故显示为此百分比
						GUI_Exec();
					}
				}
			}
			else 
			{
				FPGA_IO_flag = 0;
				if(start_flag != 8)
				{
				  start_flag = 1;
				}
				//RA8875_DispStr(50, 0, "FPGA READ DATA WRONG!          ", &tFont);
  		  delay_nms(5000);
			}
		}	
		//RA8875_DispStr(50, 0, "END THIS MEASUREMENT!                 ", &tFont);				
		delay_nms(500);	
		//RA8875_DispStr(50, 0, "BEGIN THE NEXT MEASUREMENT!                 ", &tFont);
		delay_nms(500);
  }
	else if(start_flag != 8)
	{
	  PROGBAR_Delete(progbar_test);
	  PROGBAR_Delete(progbar_test);
		CreateFramewin_warning();
	}
	PROGBAR_Delete(progbar_test);
	PROGBAR_Delete(progbar_test);
	start_flag = 1;
	FPGA_IO_flag = 0;
	FPGA_IO_data = 0;
	PG6_IO_reset();
	delay_nms(30);
	printf("\r\nFPGA RESET!\r\n");
	PG6_IO_set();
 	send_command_FPGA(RESET_COMMAND);
}

void Test_time_measure(void)
{
	if(Test_time != 0)
	{
		Test_time--;
	}
}


void TEST_type_information(void)
{
	BUTTON_Handle btn_handle_0;
	EDIT_Handle   edit_handle_0;
//   RA8875_FillRect(35,85,290,640,0xF79E);    //刷屏 覆盖操作提示框 显示录入信息对话框
// 	RA8875_FillRect(10,45,370,670,GUI_WHITE);    //刷屏 覆盖操作提示框 显示录入信息对话框
	RA8875_FillRect(13,48,367,667,GUI_WHITE);    //刷屏 覆盖操作提示框 显示录入信息对话框

	//NAME_input();
	CreateFramewin_INFORMATION();
}



BUTTON_Handle btn_handle_WORD[11];
BUTTON_Handle btn_handle_KEY[44];
EDIT_Handle   text_handle_0;
EDIT_Handle   edit_handle_0;
EDIT_Handle   edit_handle_1;	
static unsigned char  name_ch_length = 0;	
static unsigned char name_chinese[20] = {0};
static unsigned char backspace_state = 0;       //删除光标所处位置 默认为拼音框内 0：拼音框内 1：姓名显示框

static void NAME_input(void)
{
	int i = 11, j = 0 , k = 0;
	static unsigned char KEYBOARD_inital = 0;
	unsigned char tmp_char[2] = {0};
  unsigned int key = 0, key_num = 0;
  unsigned char name_flag = 0;
  unsigned char py_string[8] = {0},py_string_length = 0;
  unsigned char py_chinese[255] = {0}, py_chinese_length = 0;     //存储拼音对应的汉字字符串  一个汉字由两个字节数据组成 前面为高字节后面为低字节 下同
    //姓名中最多可包含10个汉字
  unsigned char py_char[2] = 0;
  unsigned char chinese_choice_flag = 0;                         //0：汉字选择按钮尚未创建  1：汉字选择按钮已创建
  unsigned char py_chinese_display[10][18] = {0};                 //分页显示时最多显示10页 每页为9个汉字 不足时显示为空 首尾为翻页符
  unsigned char py_chinese_page = 0 , py_chinese_page_current = 0, py_chinese_page_flag = 0;
  //           需要显示的汉字的页数    目前显示的汉字的页数        汉字分页标志位 0：未分页 1：分页

  name_ch_length = 0;
  for(i=0;i<20;i++)
  { 
	  name_chinese[i] = 0;
  }

	if(KEYBOARD_inital == 0)
	{
 		text_handle_0 = TEXT_CreateEx(45, 50, 200, 30,0,WM_CF_SHOW,(TEXT_CF_VCENTER | TEXT_CF_LEFT) ,ID_TEXT_INFORMATION,"");
    TEXT_SetFont(text_handle_0,&GUI_FontHZ_SimSun_24);//GUI_FontHZ_SimSun_24);
    TEXT_SetText(text_handle_0, "患者姓名");
		
