Liuyuewei/STM32F407_OTG_FS_Udisk/uCGUI/GUIDemo/GUI_Test _1130优化采集流程前备份.c
		edit_handle_0 = EDIT_Create(45, 85, 200, 30,ID_EDIT_INFORMATION_ch,100,WM_CF_SHOW);
		EDIT_SetFont(edit_handle_0,&GUI_FontHZ24);
		
		edit_handle_1 = EDIT_Create(345, 85, 200, 30,ID_EDIT_INFORMATION_en,100,WM_CF_SHOW);
		EDIT_SetFont(edit_handle_1,&GUI_FontHZ_SimSun_24);
		
		tmp_char[1] = 0;
		
		//1~<
		for(i = 0;i < 11;i++)
		{
			btn_handle_KEY[i] = BUTTON_Create((45+i*55),175,50,50,ID_INFORMATION_KEY_1 + i,WM_CF_SHOW);
	    BUTTON_SetFont(btn_handle_KEY[i],&GUI_Font24_ASCII);
			tmp_char[0] = Capital_keys[i];
      BUTTON_SetText(btn_handle_KEY[i], tmp_char);
		}
		//Q~-
		for(i = 0;i < 11;i++)
		{
			btn_handle_KEY[i+11] = BUTTON_Create((45+i*55),230,50,50,ID_INFORMATION_KEY_Q + i,WM_CF_SHOW);
	    BUTTON_SetFont(btn_handle_KEY[i+11],&GUI_Font24_ASCII);
			tmp_char[0] = Capital_keys[i+11];
      BUTTON_SetText(btn_handle_KEY[i+11], tmp_char);
		}
		//CAP~ENTER
		for(i = 0;i < 11;i++)
		{
			btn_handle_KEY[i+22] = BUTTON_Create((45+i*55),285,50,50,ID_INFORMATION_KEY_CAPITIAL + i,WM_CF_SHOW);
	    BUTTON_SetFont(btn_handle_KEY[i+22],&GUI_Font24_ASCII);
			tmp_char[0] = Capital_keys[i+22];
      BUTTON_SetText(btn_handle_KEY[i+22], tmp_char);
		}
		//SHIFT~EXIT
		for(i = 0;i < 11;i++)
		{
			btn_handle_KEY[i+33] = BUTTON_Create((45+i*55),340,50,50,ID_INFORMATION_KEY_SHIFT + i,WM_CF_SHOW);
	    BUTTON_SetFont(btn_handle_KEY[i+33],&GUI_Font24_ASCII);
			tmp_char[0] = Capital_keys[i+33];
      BUTTON_SetText(btn_handle_KEY[i+33], tmp_char);
		}
		
    BUTTON_SetText(btn_handle_KEY[22], "CAP");//CAP
    BUTTON_SetText(btn_handle_KEY[32], "Enter");
    BUTTON_SetText(btn_handle_KEY[43], "Exit");
    BUTTON_SetText(btn_handle_KEY[33], "Shift");//Shift		
		KEYBOARD_inital = 1;
  }
	do
	{
		if (!GUI_Exec()) 
		{
			GUI_WaitEvent();      
		}
		
		key_num =  GUI_GetKey();               //获取点击的坐标
		
		if(key_num != 0)
		{
			if( (key_num > ID_INFORMATION_KEY_BACKSPACE)
				 &(key_num < ID_INFORMATION_KEY_SLASH)
				 &(key_num != ID_INFORMATION_KEY_PLUS)
				 &(key_num != ID_INFORMATION_KEY_CAPITIAL)
				 &(key_num != ID_INFORMATION_KEY_ENTER)
				 &(key_num != ID_INFORMATION_KEY_SHIFT)
        )		                                                               //输入为字母 接收并显示汉字	
			{				
				for(i = ID_INFORMATION_KEY_Q; i < ID_INFORMATION_KEY_SLASH; i++)
				{
					py_char[1] = 0;
					if(key_num == i)
					{
						if(py_string_length < 8)                                             //最多允许输入8个英文字符 实际上一般最多为4个英文字符
						{
						  py_string[py_string_length] = Lower_keys[i - ID_INFORMATION_KEY_1];
  					  py_string_length = py_string_length + 1;
							
						  EDIT_SetText(edit_handle_1,py_string);                       //将新输入的英文字符显示在英文字符框内
						  
PY_START:
							sprintf(py_chinese,"%s",py_ime(py_string));                         //获取拼音对应的汉字
							
							py_chinese_length = strlen(py_chinese);                             //拼音对应的汉字的个数*2
							
							if(py_chinese_length != 0)                                          //如果汉字数组不为空 则进行汉字选择
							{
								if(chinese_choice_flag == 0)                                      //是否创建汉字选择按钮
								{
									chinese_choice_flag = 1;
									for(j = 0;j < 11;j++)
		              {
			              btn_handle_WORD[j] = BUTTON_Create((45+j*55),120,50,50,ID_INFORMATION_WORD_1 + j,WM_CF_SHOW);
                    BUTTON_SetFont(btn_handle_WORD[j],&GUI_FontHZ24);
										WM_DisableWindow(btn_handle_WORD[j]);
		              }
								}
								else
								{
									for(j = 0;j < 11;j++)      //将汉字选择按钮清空并禁用
		              {
									  BUTTON_SetText(btn_handle_WORD[j]," ");
			              WM_DisableWindow(btn_handle_WORD[j]);
		              }
								}								
								
								//清空相关标志位
                py_chinese_page_flag = 0;				
                for(k = 0; k < 10 ; k++)
                {
									for(j =0; j < 18; j++)
									{
										py_chinese_display[k][j] = 0;
									}
                }
								
								//不够12个汉字 则不进行翻页 此时翻页按钮不使能且不显示翻页图标 汉字从第一个按钮上开始显示 有几个汉字则使能几个按钮
								if(py_chinese_length < 22)                                        
								{
									k = 0;
									//显示汉字并使能相应按钮
									for(j = 0; j < (py_chinese_length-1); j = j+2)
									{
										tmp_char[0] = py_chinese[j];
										tmp_char[1] = py_chinese[j+1];
										WM_EnableWindow(btn_handle_WORD[(j/2)]);
										BUTTON_SetFont(btn_handle_WORD[(j/2)],&GUI_FontHZ24);
										BUTTON_SetText(btn_handle_WORD[(j/2)], tmp_char);
										k++;
									}
									//不显示汉字的按钮则不使能  即点击后无反应
									for(;k<11;k++)
									{
										WM_DisableWindow(btn_handle_WORD[k]);
									}
									py_chinese_page_flag = 0;                     //不需要翻页
								}
								else        //多于11个汉字 则进行翻页选择 
								{
									//显示翻页按钮 且当前为第一页 故只有下翻页按钮 没有向上翻页按钮
									WM_EnableWindow(btn_handle_WORD[10]);
									BUTTON_SetFont(btn_handle_WORD[10],&GUI_Font24_ASCII);
									BUTTON_SetText(btn_handle_WORD[10], ">>");
									//将汉字分到几个数组中方便显示 其中第一页显示10个汉字 其他每页显示9个汉字
									for(j = 0; j < 10; j++)
									{
										tmp_char[0] = py_chinese[j*2];
										tmp_char[1] = py_chinese[j*2+1];
										WM_EnableWindow(btn_handle_WORD[j]);
										BUTTON_SetFont(btn_handle_WORD[j],&GUI_FontHZ24);
										BUTTON_SetText(btn_handle_WORD[j], tmp_char);								
									}
									
									py_chinese_page_current = 0;
									py_chinese_page_flag = 1;        //需要翻页
									
									for(k = 0; k < 9 ; k++)
									{
										if((20+k*18) < py_chinese_length)      //有尚未分配的汉字 则进行分配到数组
										{
											py_chinese_page = k+1;										
											for(j = 0; j < 18; j++)
											{
												if((20+j+k*18) < py_chinese_length)          //有尚未分配的汉字 则进行分配到数组
												{
													py_chinese_display[py_chinese_page][j] = py_chinese[20+j+k*18];
												}
												else                                         //无尚未分配的汉字 则结束
												{
													j = 18;
													k = 9;
												}
											}
									  }
										else                                   //无尚未分配的汉字 则结束
										{
											k = 9;
										}
								  }
								}
							}
							else      //拼音没有对应的汉字
							{
								if(chinese_choice_flag == 1)
								{
								  for(j = 0;j < 11;j++)      //将汉字选择按钮禁用
		              {
									  BUTTON_SetText(btn_handle_WORD[j]," ");
			              WM_DisableWindow(btn_handle_WORD[j]);
		              }
							  }
								//清空相关标志位
                py_chinese_page_flag = 0;				
                for(k = 0; k < 10 ; k++)
                {
									for(j =0; j < 18; j++)
									{
										py_chinese_display[k][j] = 0;
									}
                }	
							}
						}						
					}
				}
			}
			else if(
				     //(py_chinese_page_flag == 0)                           //点击的是汉字选择按钮 则直接选择按扭对应的汉字即可
				     (key_num > (ID_INFORMATION_WORD_1 - 1))
				    &(key_num < (ID_INFORMATION_WORD_B +1))
			        )
			{
				if(py_chinese_page_flag == 0)                               //未进行翻页 则此时选择对应的汉字即可
				{
					if(name_ch_length < 10)
					{
						name_chinese[name_ch_length*2] = py_chinese[(key_num - ID_INFORMATION_WORD_1)*2];
						name_chinese[name_ch_length*2+1] = py_chinese[(key_num - ID_INFORMATION_WORD_1)*2 + 1];
						name_ch_length = name_ch_length+1;
						EDIT_SetText(edit_handle_0,name_chinese);
						
