Liuyuewei/STM32F407_OTG_FS_Udisk/uCGUI/GUIDemo/GUI_Test _1130优化采集流程前备份.c
						//汉字选择完毕 刷新汉字选择按钮为空且刷新标志位
						for(j = 0; j < 11; j++)
            {
						  BUTTON_SetText(btn_handle_WORD[j]," ");
							WM_DisableWindow(btn_handle_WORD[j]);
            }
						for(j = 0; j < 8;j++)
						{
							py_string[j] = 0;
						}
						for(j = 0; j < 255;j++)
						{
							py_chinese[j] = 0;
						}
						for(k = 0; k < 10 ; k++)
            {
							for(j =0; j < 18; j++)
							{
								py_chinese_display[k][j] = 0;
							}
            }
						py_chinese_page = 0;
						py_chinese_page_current = 0;
						py_chinese_page_flag = 0;
						EDIT_SetText(edit_handle_1," ");
						py_string_length = 0;
					}
					else                                                     //需要进行报错处理 未处理
					{
						;;;
					}
			  }
				else                                                        //有分页 需要判断为哪个按钮并进行不同的操作
				{
					if(py_chinese_page_current == 0)                          //当前页为首页  则只有在最后一个按钮时翻页 其他情况下选择汉字即可
					{
						if(                                                     //首页 则前十一个按钮直接返回汉字即可
							 (key_num > (ID_INFORMATION_WORD_1 - 1))
				      &(key_num < (ID_INFORMATION_WORD_B))
							)
						{
							if(name_ch_length < 10)
							{
								name_chinese[name_ch_length*2] = py_chinese[(key_num - ID_INFORMATION_WORD_1)*2];
								name_chinese[name_ch_length*2+1] = py_chinese[(key_num - ID_INFORMATION_WORD_1)*2 + 1];
								name_ch_length = name_ch_length+1;
						    EDIT_SetText(edit_handle_0,name_chinese);
								
								//汉字选择完毕 刷新汉字选择按钮为空且刷新标志位
								for(j = 0; j < 11; j++)
								{
									BUTTON_SetText(btn_handle_WORD[j]," ");
									WM_DisableWindow(btn_handle_WORD[j]);
								}
								for(j = 0; j < 8;j++)
								{
									py_string[j] = 0;
								}
								for(j = 0; j < 255;j++)
								{
									py_chinese[j] = 0;
								}
								for(k = 0; k < 10 ; k++)
                {
							    for(j =0; j < 18; j++)
							    {
								    py_chinese_display[k][j] = 0;
							    }
                }
								py_chinese_page = 0;
								py_chinese_page_current = 0;
								py_chinese_page_flag = 0;
								EDIT_SetText(edit_handle_1," ");
						    py_string_length = 0;
							}
							else                                                     //需要进行报错处理 未处理
							{
								;;;
							}
						}
						else                                                       //点击的为翻页按钮 则进行翻页且刷新按钮上的汉字
						{
							//显示上翻页按钮 下翻页按钮是否显示需要进行判断
							WM_EnableWindow(btn_handle_WORD[0]);
							BUTTON_SetFont(btn_handle_WORD[0],&GUI_Font24_ASCII);
							BUTTON_SetText(btn_handle_WORD[0],  "<<");
							if(py_chinese_page > 1)      // 总页面多于2页 则添加向下翻页按钮
							{
								WM_EnableWindow(btn_handle_WORD[10]);
								BUTTON_SetFont(btn_handle_WORD[10],&GUI_Font24_ASCII);
							  BUTTON_SetText(btn_handle_WORD[10], ">>");
							}
							else
							{
								WM_DisableWindow(btn_handle_WORD[10]);
								BUTTON_SetFont(btn_handle_WORD[10],&GUI_Font24_ASCII);
							  BUTTON_SetText(btn_handle_WORD[10], " ");
							}
							//在中间9个按键上显示汉字
							for(i = 0;i < 9;i++)
							{
								tmp_char[0] = py_chinese_display[py_chinese_page_current+1][i*2];
								tmp_char[1] = py_chinese_display[py_chinese_page_current+1][i*2+1];
								BUTTON_SetFont(btn_handle_WORD[i+1],&GUI_FontHZ24);
								if((tmp_char[0]+tmp_char[1]) != 0)         //汉字不为空
								{
								  WM_EnableWindow(btn_handle_WORD[i+1]);
								  BUTTON_SetText(btn_handle_WORD[i+1], tmp_char);	
								}
								else                                      //空字符 无汉字 则显示为空且禁用按钮
								{
									BUTTON_SetText(btn_handle_WORD[i+1], " ");	
									WM_DisableWindow(btn_handle_WORD[i+1]);
								}
							}
							py_chinese_page_current = py_chinese_page_current+1;
						}
					}
					else if(py_chinese_page_current != py_chinese_page)                       //当前页为中间页 
					{
						if(                                                     //中间页 则中间九个按钮直接返回汉字即可
							 (key_num > (ID_INFORMATION_WORD_1))
				      &(key_num < (ID_INFORMATION_WORD_B))
							)
						{
							if(name_ch_length < 10)
							{
								name_chinese[name_ch_length*2] = py_chinese_display[py_chinese_page_current][(key_num - ID_INFORMATION_WORD_2)*2];
								name_chinese[name_ch_length*2+1] = py_chinese_display[py_chinese_page_current][(key_num - ID_INFORMATION_WORD_2)*2 + 1];
								name_ch_length = name_ch_length+1;
						    EDIT_SetText(edit_handle_0,name_chinese);
								
								//汉字选择完毕 刷新汉字选择按钮为空且刷新标志位
								for(j = 0; j < 11; j++)
								{
									WM_DisableWindow(btn_handle_WORD[j]);
									BUTTON_SetText(btn_handle_WORD[j]," ");
								}
								for(j = 0; j < 8;j++)
								{
									py_string[j] = 0;
								}
								for(j = 0; j < 255;j++)
								{
									py_chinese[j] = 0;
								}
								for(k = 0; k < 10 ; k++)
                {
							    for(j =0; j < 18; j++)
							    {
								    py_chinese_display[k][j] = 0;
							    }
                }
								py_chinese_page = 0;
								py_chinese_page_current = 0;
								py_chinese_page_flag = 0;
								EDIT_SetText(edit_handle_1," ");
						    py_string_length = 0;
							}
							else                                                     //需要进行报错处理 未处理
							{
								;;;
							}
						}
						else if(key_num == ID_INFORMATION_WORD_1)                  //点击的为上翻页按钮 则进行翻页且刷新按钮上的汉字
						{
							//显示下翻页按钮 上翻页按钮是否显示需要进行判断
							WM_EnableWindow(btn_handle_WORD[10]);
							BUTTON_SetFont(btn_handle_WORD[10],&GUI_Font24_ASCII);
							BUTTON_SetText(btn_handle_WORD[10],  ">>");
							if(py_chinese_page_current == 1)      //当前页面是第二页 不显示上翻页按钮 且显示10个汉字
							{
								for(i = 0;i < 10;i++)
							  {
								  tmp_char[0] = py_chinese[i*2];
								  tmp_char[1] = py_chinese[i*2+1];
									WM_EnableWindow(btn_handle_WORD[i]);
								  BUTTON_SetFont(btn_handle_WORD[i],&GUI_FontHZ24);
								  BUTTON_SetText(btn_handle_WORD[i], tmp_char);	
							  }
							}
							else
							{
								//显示上翻页按钮
								WM_EnableWindow(btn_handle_WORD[0]);
								BUTTON_SetFont(btn_handle_WORD[0],&GUI_Font24_ASCII);
							  BUTTON_SetText(btn_handle_WORD[0],  "<<");
								//在中间9个按键上显示汉字
								for(i = 0;i < 9;i++)
								{
									tmp_char[0] = py_chinese_display[py_chinese_page_current-1][i*2];
									tmp_char[1] = py_chinese_display[py_chinese_page_current-1][i*2+1];
									WM_EnableWindow(btn_handle_WORD[i+1]);
									BUTTON_SetFont(btn_handle_WORD[i+1],&GUI_FontHZ24);
									BUTTON_SetText(btn_handle_WORD[i+1], tmp_char);	
								}
							}							
							py_chinese_page_current = py_chinese_page_current - 1;
						}
						else                                     //点击的为下翻页按钮 则进行翻页且刷新按钮上的汉字
						{
							//显示上翻页按钮 下翻页按钮是否显示需要进行判断
							WM_EnableWindow(btn_handle_WORD[0]);
							BUTTON_SetFont(btn_handle_WORD[0],&GUI_Font24_ASCII);
							BUTTON_SetText(btn_handle_WORD[0],  "<<");
							if(py_chinese_page_current != (py_chinese_page-1))      //当前页面不是倒数第二页 显示下翻页按钮 
							{
								WM_EnableWindow(btn_handle_WORD[10]);
								BUTTON_SetFont(btn_handle_WORD[10],&GUI_Font24_ASCII);
							  BUTTON_SetText(btn_handle_WORD[10],  ">>");
							}
							else
							{
								WM_DisableWindow(btn_handle_WORD[10]);
								BUTTON_SetFont(btn_handle_WORD[10],&GUI_Font24_ASCII);
							  BUTTON_SetText(btn_handle_WORD[10],  " ");
							}
							//在中间9个按键上显示汉字
						  for(i = 0;i < 9;i++)
							{
								tmp_char[0] = py_chinese_display[py_chinese_page_current+1][i*2];
								tmp_char[1] = py_chinese_display[py_chinese_page_current+1][i*2+1];
								BUTTON_SetFont(btn_handle_WORD[i+1],&GUI_FontHZ24);
								if((tmp_char[0] + tmp_char[1]) != 0)
								{
								  WM_EnableWindow(btn_handle_WORD[i+1]);
								  BUTTON_SetText(btn_handle_WORD[i+1], tmp_char);	
								}
								else
								{
									WM_DisableWindow(btn_handle_WORD[i+1]);
								  BUTTON_SetText(btn_handle_WORD[i+1], " ");	
								}
							}													
							py_chinese_page_current = py_chinese_page_current + 1;
						}
					}
					else                                                            //当前页面为最后一页 
					{
						if(                                                     //最后一页 则判断是否有汉字 有则返回汉字 无则空操作
							 (key_num > (ID_INFORMATION_WORD_1))
				      &(key_num < (ID_INFORMATION_WORD_B))
							)
						{
							if(name_ch_length < 10)
							{
								if(
									 (((py_chinese_display[py_chinese_page_current][(key_num - ID_INFORMATION_WORD_2)*2])
								  +(py_chinese_display[py_chinese_page_current][(key_num - ID_INFORMATION_WORD_2)*2 + 1])) != 0)
								  )
								{
									name_chinese[name_ch_length*2] = py_chinese_display[py_chinese_page_current][(key_num - ID_INFORMATION_WORD_2)*2];
									name_chinese[name_ch_length*2+1] = py_chinese_display[py_chinese_page_current][(key_num - ID_INFORMATION_WORD_2)*2 + 1];
									name_ch_length = name_ch_length+1;
      						EDIT_SetText(edit_handle_0,name_chinese);
									
