Liuyuewei/STM32F407_OTG_FS_Udisk/uCGUI/GUIDemo/GUI_Test _1130优化采集流程前备份.c
									//汉字选择完毕 刷新汉字选择按钮为空且刷新标志位
									for(j = 0; j < 11; j++)
									{
										WM_DisableWindow(btn_handle_WORD[j]);
										BUTTON_SetText(btn_handle_WORD[j]," ");
									}
									for(j = 0; j < 8;j++)
									{
										py_string[j] = 0;
									}
									for(j = 0; j < 255;j++)
									{
										py_chinese[j] = 0;
									}
									for(k = 0; k < 10 ; k++)
                  {
							      for(j =0; j < 18; j++)
							      {
								      py_chinese_display[k][j] = 0;
							      }
                  }
									py_chinese_page = 0;
									py_chinese_page_current = 0;
									py_chinese_page_flag = 0;
									EDIT_SetText(edit_handle_1," ");
						      py_string_length = 0;
								}
							}
							else                                                     //需要进行报错处理 未处理
							{
								;;;
							}
						}
						else if(key_num == ID_INFORMATION_WORD_1)                  //点击的为上翻页按钮 则进行翻页且刷新按钮上的汉字
						{
							if(py_chinese_page == 1)                                   //如果只有两页 则显示下翻按钮 刷新字符
							{
								WM_EnableWindow(btn_handle_WORD[10]);
								BUTTON_SetFont(btn_handle_WORD[10],&GUI_Font24_ASCII);
								BUTTON_SetText(btn_handle_WORD[10],  ">>");
								for(i = 0;i < 10;i++)
								{
									tmp_char[0] = py_chinese[i*2];
									tmp_char[1] = py_chinese[i*2+1];
									WM_EnableWindow(btn_handle_WORD[i]);
									BUTTON_SetFont(btn_handle_WORD[i],&GUI_FontHZ24);
									BUTTON_SetText(btn_handle_WORD[i], tmp_char);	
								}							
							}
							else                                                          //如果总页面大于两页 则显示上下翻按钮 刷新字符
							{
								WM_EnableWindow(btn_handle_WORD[0]);
								BUTTON_SetFont(btn_handle_WORD[0],&GUI_Font24_ASCII);
								BUTTON_SetText(btn_handle_WORD[0],  "<<");
								WM_EnableWindow(btn_handle_WORD[10]);
								BUTTON_SetFont(btn_handle_WORD[10],&GUI_Font24_ASCII);
								BUTTON_SetText(btn_handle_WORD[10],  ">>");
								for(i = 0;i < 9;i++)
								{
									tmp_char[0] = py_chinese_display[py_chinese_page_current-1][i*2];
									tmp_char[1] = py_chinese_display[py_chinese_page_current-1][i*2+1];
									WM_EnableWindow(btn_handle_WORD[i+1]);
									BUTTON_SetFont(btn_handle_WORD[i+1],&GUI_FontHZ24);
									BUTTON_SetText(btn_handle_WORD[i+1], tmp_char);	
								}	
							}							
						}
						py_chinese_page_current = py_chinese_page_current - 1;
					}
				}
			}
			else                                               
			{	
				switch(key_num)
				{
					case ID_INFORMATION_KEY_EXIT:                   //退出当前键盘输入界面
					{
						name_flag = 1;
						for(i = 0; i < 11; i++)
						{
							BUTTON_Delete(btn_handle_WORD[i]);
						}
						for(i = 0; i < 44; i++)
						{
							BUTTON_Delete(btn_handle_KEY[i]);
						}
						TEXT_Delete(text_handle_0);
						EDIT_Delete(edit_handle_0);
						KEYBOARD_inital = 0;
						break;
					}
					case ID_INFORMATION_KEY_ENTER:                 //确认按钮 确认保存姓名数据并退出
					{
						break;
					}
					case ID_INFORMATION_KEY_BACKSPACE:             //删除按钮 删除edit显示框中内容 一次删除一个汉字或一个英文字母
					{
						if(backspace_state == 1)
						{
							name_chinese[(strlen(name_chinese)-1)] = 0;
							name_chinese[(strlen(name_chinese)-2)] = 0;
							EDIT_SetText(edit_handle_0,name_chinese);
						}
						else
						{
							if(strlen(py_string) > 0)
							{
							  py_string[(strlen(py_string)-1)] = 0;
								py_string_length = strlen(py_string);
							  EDIT_SetText(edit_handle_1,py_string);
							  goto PY_START;
							}
						}
						break;
					}
					case ID_INFORMATION_KEY_SHIFT:                 //切换键盘上英文字母的大小写
					{
						break;
					}
					case ID_EDIT_INFORMATION_ch:                   //选中姓名显示框
					{
						backspace_state = 1;                         //标记将回删姓名显示框内内容
						break;
					}
					case ID_EDIT_INFORMATION_en:                   //选中拼音显示框
					{
						backspace_state = 0;                         //标记将回删拼音显示框内内容
						break;
					}
					default:
					{
						break;
					}
				}
		 }
		}
  }while(name_flag == 0);
	
	
}


// USER START (Optionally insert additional public code)
// USER END

/*************************** End of file ****************************/